stress-test.yml
config:
  target: "http://localhost:3001"
  phases:
    - duration: 60
      arrivalRate: 500
  variables:
    id:
      - "9939992"
      - "9955849"
      - "9609594"
      - "9750000"
      - "9900005"
      - "9586325"
      - "9685324"
      - "9999854"
scenarios:
  - name: "retrieve products by description and collection name"
    flow:
      - get:
          url: "/api/product_scroller/products/similar/id={{ id }}"
      - get:
          url: "/api/product_scroller/products/collection/id={{ id }}"