stress-test.yml
config:
  target: "http://localhost:3001"
  phases:
    - duration: 60
      arrivalRate: 20
  variables:
    id:
      - "790"
      - "170800"
      - "25"
      - "8750000"
      - "990000"
scenarios:
  - name: "post a new product"
    weight: 1
    flow:
      - loop:
        - post:
            url: "/api/product_scroller/product"
            json:
              product_name: "TEST product"
              image_one_url: "TEST url"
              image_two_url: "TEST url2"
              page_url: "TEST page url"
              price: 90.30
              hearted: "f"
              brief_description: "short description for test"
              collection_name: "TEST TEST TEST"
        count: 40
  - name: "retrieve products by collection name"
    weight: 9
    flow:
      - loop:
        - get:
            url: "/api/product_scroller/products/collection/id={{ id }}"
        count: 40